Revit 2027 API
BuiltInFailures.LinkFailures.NoConstraintsToLinks1 Property
 Constraints may not be created to linked instances using Shared Locations. Constraints will be removed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoConstraintsToLinks1 { get; }
Public Shared ReadOnly Property NoConstraintsToLinks1 As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoConstraintsToLinks1 {
	FailureDefinitionId^ get ();
}
static member NoConstraintsToLinks1 : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace